# Задание 4.2.1 # Задание на самопроверку.
# Напишите функцию print_2_add_2, которая будет складывать 2 и 2
# и печатать этот результат. Не забудьте вызвать функцию, чтобы увидеть результат.

def print_2_add_2():
    x = 2 + 2
    print(x)

print_2_add_2()

#Задание 4.2.2 Задание на самопроверку.
# Напишите функцию hello_world, которая будет печать приветственную строку «Hello World».

def hellow():
    print("Hello Wolrd!")

hellow()